# Pandas Exercises

Time to test your new pandas skills! Use the two csv files in this folder to complete the tasks in bold below!

** NOTE: ALL TASKS MUST BE DONE IN ONE LINE OF PANDAS CODE. GOT STUCK? NO PROBLEM! CHECK OUT THE SOLUTIONS LECTURE! **

** Import pandas and read in the banklist.csv file into a dataframe called banks. **

In [1]:
import pandas as pd

In [3]:
banks = pd.read_csv('C:/Users/ongch/apps/data-science/Python-for-Finance/03- General Pandas/Pandas-Exercises/banklist.csv')

** Show the head of the dataframe **

In [26]:
# CODE HERE

In [4]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** What are the column names? **

In [0]:
# CODE HERE

In [5]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** How many States (ST) are represented in this data set? **

In [0]:
# CODE HERE

In [11]:
# return count of unique item in selected column
banks['ST'].nunique()

44

** Get a list or array of all the states in the data set. **

In [0]:
# CODE HERE

In [12]:
# return an array of unique items for selected column
banks['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

** What are the top 5 states with the most failed banks? **

In [0]:
# CODE HERE

In [15]:
banks.groupby('ST').count().sort_values('Bank Name', ascending=False).iloc[:5]['Bank Name']

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

** What are the top 5 acquiring institutions? **

In [0]:
# CODE HERE

In [19]:
banks['Acquiring Institution'].value_counts().iloc[:5]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

** How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?**

In [0]:
# CODE HERE

In [22]:
banks[banks['Acquiring Institution'] == 'State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

** What is the most common city in California for a bank to fail in?**

In [0]:
# CODE HERE

In [33]:
banks[banks['ST'] == 'CA'].groupby('City').count().sort_values('Bank Name', ascending=False).iloc[:5]

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4
San Diego,2,2,2,2,2,2
San Francisco,2,2,2,2,2,2
Palm Desert,2,2,2,2,2,2
La Jolla,2,2,2,2,2,2

** How many failed banks don't have the word "Bank" in their name? **

In [0]:
# CODE HERE

In [44]:
# banks['Bank Name'].apply(lambda bank: "Bank" not in bank).value_counts()
banks['Bank Name'].apply(lambda bank: "Bank" not in bank).sum()

14

** How many bank names start with the letter 's' ? **

In [0]:
# CODE HERE

In [49]:
banks['Bank Name'].apply(lambda bank: bank.casefold().startswith('s')).sum()

53

** How many CERT values are above 20000 ? **

In [61]:
# CODE HERE

In [51]:
banks['CERT'].apply(lambda val: val > 20000).sum()

417

** How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )**

In [65]:
# CODE HERE

In [55]:
banks['Bank Name'].apply(lambda bank: len(bank.split()) == 2).sum()

114

**Bonus: How many banks closed in the year 2008? (this is hard because we technically haven't learned about time series with pandas yet! Feel free to skip this one!**

In [0]:
# CODE HERE

In [59]:
banks['Closing Date'].apply(lambda dat: dat.split('-')[-1] == '08').sum()

25

# GREAT JOB!